#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2025z-319020/roles/iam.serviceAccountUser/serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-c7a17e4c-bucket-dags/dbt-dag.py]
module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"]: Refreshing state... [id=europe-west1-demo-lab-c7a17e4c-bucket-dags/data-dag.py]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2025z-319020/regions/europe-west1/subnetworks/composer-subnet-01]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2025z-319020/roles/composer.ServiceAgentV2Ext/serviceAccount:service-214296123186@cloudcomposer-accounts.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2025z-319020/roles/dataproc.editor/serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2025z-319020/serviceAccounts/tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com]
module.metastore.google_project_service.api-metastore["metastore.googleapis.com"]: Refreshing state... [id=tbd-2025z-319020/metastore.googleapis.com]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2025z-319020-data]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2025z-319020-code]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2025z-319020-data/roles/storage.objectUser/serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2025z-319020-code-spark-job.py]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2025z-319020/composer.googleapis.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2025z-319020-code/roles/storage.objectViewer/serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2025z-319020/roles/composer.worker/serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2025z-319020/global/networks/main-vpc]
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2025z-319020/artifactregistry.googleapis.com]
data.google_client_config.provider: Reading...
module.composer.module.composer.google_composer_environment.composer_env: Refreshing state... [id=projects/tbd-2025z-319020/locations/europe-west1/environments/demo-lab]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2025z-319020/global/firewalls/fw-allow-ingress-iap]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2025z-319020/regions/europe-west1/subnetworks/subnet-01]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2025z-319020/global/firewalls/default-internal-allow-all]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2025z-319020/regions/europe-west1/routers/nat-router]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2025z-319020"/regions/"europe-west1"/zones/<null>]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2025z-319020/global/firewalls/allow-all-internal]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2025z-319020/global/routes/egress-internet]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2025z-319020/europe-west1/nat-router/nat-gateway]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2025z-319020/dataproc.googleapis.com]
module.dataproc.google_service_account.dataproc_sa: Refreshing state... [id=projects/tbd-2025z-319020/serviceAccounts/tbd-2025z-319020-dataproc-sa@tbd-2025z-319020.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket.dataproc_temp: Refreshing state... [id=tbd-2025z-319020-dataproc-temp]
module.dataproc.google_storage_bucket.dataproc_staging: Refreshing state... [id=tbd-2025z-319020-dataproc-staging]
module.dataproc.google_project_iam_member.dataproc_worker: Refreshing state... [id=tbd-2025z-319020/roles/dataproc.worker/serviceAccount:tbd-2025z-319020-dataproc-sa@tbd-2025z-319020.iam.gserviceaccount.com]
module.dataproc.google_project_iam_member.dataproc_bigquery_data_editor: Refreshing state... [id=tbd-2025z-319020/roles/bigquery.dataEditor/serviceAccount:tbd-2025z-319020-dataproc-sa@tbd-2025z-319020.iam.gserviceaccount.com]
module.dataproc.google_project_iam_member.dataproc_bigquery_user: Refreshing state... [id=tbd-2025z-319020/roles/bigquery.user/serviceAccount:tbd-2025z-319020-dataproc-sa@tbd-2025z-319020.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket_iam_member.staging_bucket_iam: Refreshing state... [id=b/tbd-2025z-319020-dataproc-staging/roles/storage.objectAdmin/serviceAccount:tbd-2025z-319020-dataproc-sa@tbd-2025z-319020.iam.gserviceaccount.com]
module.dataproc.google_storage_bucket_iam_member.temp_bucket_iam: Refreshing state... [id=b/tbd-2025z-319020-dataproc-temp/roles/storage.objectAdmin/serviceAccount:tbd-2025z-319020-dataproc-sa@tbd-2025z-319020.iam.gserviceaccount.com]
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2025z-319020/locations/europe/repositories/eu.gcr.io]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2025z-319020/regions/europe-west1/clusters/tbd-cluster]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster has been deleted
  - resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
        id                            = "projects/tbd-2025z-319020/regions/europe-west1/clusters/tbd-cluster"
      - name                          = "tbd-cluster" -> null
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # module.composer.google_compute_subnetwork.composer-subnet will be destroyed
  # (because google_compute_subnetwork.composer-subnet is not in configuration)
  - resource "google_compute_subnetwork" "composer-subnet" {
      - creation_timestamp         = "2026-01-20T11:21:40.768-08:00" -> null
      - gateway_address            = "10.11.0.1" -> null
      - id                         = "projects/tbd-2025z-319020/regions/europe-west1/subnetworks/composer-subnet-01" -> null
      - ip_cidr_range              = "10.11.0.0/16" -> null
      - name                       = "composer-subnet-01" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/tbd-2025z-319020/global/networks/main-vpc" -> null
      - private_ip_google_access   = false -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "tbd-2025z-319020" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "europe-west1" -> null
      - secondary_ip_range         = [] -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/tbd-2025z-319020/regions/europe-west1/subnetworks/composer-subnet-01" -> null
      - stack_type                 = "IPV4_ONLY" -> null
        # (6 unchanged attributes hidden)

      - log_config {
          - aggregation_interval = "INTERVAL_10_MIN" -> null
          - filter_expr          = "true" -> null
          - flow_sampling        = 0.5 -> null
          - metadata             = "INCLUDE_ALL_METADATA" -> null
        }
    }

  # module.composer.google_project_iam_member.composer-member will be destroyed
  # (because google_project_iam_member.composer-member is not in configuration)
  - resource "google_project_iam_member" "composer-member" {
      - etag    = "BwZI1ridUs4=" -> null
      - id      = "tbd-2025z-319020/roles/composer.worker/serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - project = "tbd-2025z-319020" -> null
      - role    = "roles/composer.worker" -> null
    }

  # module.composer.google_project_iam_member.dataproc-editor-iam will be destroyed
  # (because google_project_iam_member.dataproc-editor-iam is not in configuration)
  - resource "google_project_iam_member" "dataproc-editor-iam" {
      - etag    = "BwZI1ridUs4=" -> null
      - id      = "tbd-2025z-319020/roles/dataproc.editor/serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - project = "tbd-2025z-319020" -> null
      - role    = "roles/dataproc.editor" -> null
    }

  # module.composer.google_project_iam_member.dataproc-sa-user-iam will be destroyed
  # (because google_project_iam_member.dataproc-sa-user-iam is not in configuration)
  - resource "google_project_iam_member" "dataproc-sa-user-iam" {
      - etag    = "BwZI1ridUs4=" -> null
      - id      = "tbd-2025z-319020/roles/iam.serviceAccountUser/serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - project = "tbd-2025z-319020" -> null
      - role    = "roles/iam.serviceAccountUser" -> null
    }

  # module.composer.google_project_service.api["composer.googleapis.com"] will be destroyed
  # (because google_project_service.api is not in configuration)
  - resource "google_project_service" "api" {
      - disable_on_destroy = false -> null
      - id                 = "tbd-2025z-319020/composer.googleapis.com" -> null
      - project            = "tbd-2025z-319020" -> null
      - service            = "composer.googleapis.com" -> null
    }

  # module.composer.google_service_account.tbd-composer-sa will be destroyed
  # (because google_service_account.tbd-composer-sa is not in configuration)
  - resource "google_service_account" "tbd-composer-sa" {
      - account_id   = "tbd-2025z-319020-data" -> null
      - disabled     = false -> null
      - email        = "tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - id           = "projects/tbd-2025z-319020/serviceAccounts/tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - member       = "serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - name         = "projects/tbd-2025z-319020/serviceAccounts/tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - project      = "tbd-2025z-319020" -> null
      - unique_id    = "116933592012053632924" -> null
        # (2 unchanged attributes hidden)
    }

  # module.data-pipelines.google_storage_bucket.tbd-code-bucket will be destroyed
  # (because google_storage_bucket.tbd-code-bucket is not in configuration)
  - resource "google_storage_bucket" "tbd-code-bucket" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {} -> null
      - enable_object_retention     = false -> null
      - force_destroy               = true -> null
      - id                          = "tbd-2025z-319020-code" -> null
      - location                    = "EUROPE-WEST1" -> null
      - name                        = "tbd-2025z-319020-code" -> null
      - project                     = "tbd-2025z-319020" -> null
      - project_number              = 214296123186 -> null
      - public_access_prevention    = "enforced" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/tbd-2025z-319020-code" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {} -> null
      - uniform_bucket_level_access = false -> null
      - url                         = "gs://tbd-2025z-319020-code" -> null

      - soft_delete_policy {
          - effective_time             = "2026-01-20T19:21:40.836Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.data-pipelines.google_storage_bucket.tbd-data-bucket will be destroyed
  # (because google_storage_bucket.tbd-data-bucket is not in configuration)
  - resource "google_storage_bucket" "tbd-data-bucket" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {} -> null
      - enable_object_retention     = false -> null
      - force_destroy               = true -> null
      - id                          = "tbd-2025z-319020-data" -> null
      - location                    = "EUROPE-WEST1" -> null
      - name                        = "tbd-2025z-319020-data" -> null
      - project                     = "tbd-2025z-319020" -> null
      - project_number              = 214296123186 -> null
      - public_access_prevention    = "enforced" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/tbd-2025z-319020-data" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {} -> null
      - uniform_bucket_level_access = false -> null
      - url                         = "gs://tbd-2025z-319020-data" -> null

      - soft_delete_policy {
          - effective_time             = "2026-01-20T19:21:40.818Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer will be destroyed
  # (because google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer is not in configuration)
  - resource "google_storage_bucket_iam_member" "tbd-code-bucket-iam-viewer" {
      - bucket = "b/tbd-2025z-319020-code" -> null
      - etag   = "CAI=" -> null
      - id     = "b/tbd-2025z-319020-code/roles/storage.objectViewer/serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor will be destroyed
  # (because google_storage_bucket_iam_member.tbd-data-bucket-iam-editor is not in configuration)
  - resource "google_storage_bucket_iam_member" "tbd-data-bucket-iam-editor" {
      - bucket = "b/tbd-2025z-319020-data" -> null
      - etag   = "CAI=" -> null
      - id     = "b/tbd-2025z-319020-data/roles/storage.objectUser/serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectUser" -> null
    }

  # module.data-pipelines.google_storage_bucket_object.dag-code["data-dag.py"] will be destroyed
  # (because google_storage_bucket_object.dag-code is not in configuration)
  - resource "google_storage_bucket_object" "dag-code" {
      - bucket              = "europe-west1-demo-lab-c7a17e4c-bucket" -> null
      - content_type        = "text/plain; charset=utf-8" -> null
      - crc32c              = "7kO1Pg==" -> null
      - detect_md5hash      = "9yl2fFeQ7MJJ565lS3BR/g==" -> null
      - event_based_hold    = false -> null
      - generation          = 1768938342408266 -> null
      - id                  = "europe-west1-demo-lab-c7a17e4c-bucket-dags/data-dag.py" -> null
      - md5hash             = "9yl2fFeQ7MJJ565lS3BR/g==" -> null
      - media_link          = "https://storage.googleapis.com/download/storage/v1/b/europe-west1-demo-lab-c7a17e4c-bucket/o/dags%2Fdata-dag.py?generation=1768938342408266&alt=media" -> null
      - name                = "dags/data-dag.py" -> null
      - output_name         = "dags/data-dag.py" -> null
      - self_link           = "https://www.googleapis.com/storage/v1/b/europe-west1-demo-lab-c7a17e4c-bucket/o/dags%2Fdata-dag.py" -> null
      - source              = "modules/data-pipeline/resources/data-dag.py" -> null
      - storage_class       = "STANDARD" -> null
      - temporary_hold      = false -> null
        # (5 unchanged attributes hidden)
    }

  # module.data-pipelines.google_storage_bucket_object.dbt-dag-code["dbt-dag.py"] will be destroyed
  # (because google_storage_bucket_object.dbt-dag-code is not in configuration)
  - resource "google_storage_bucket_object" "dbt-dag-code" {
      - bucket              = "europe-west1-demo-lab-c7a17e4c-bucket" -> null
      - content_type        = "text/plain; charset=utf-8" -> null
      - crc32c              = "7hysIQ==" -> null
      - detect_md5hash      = "I4t9GoCkwXqXT8LfIZcBOw==" -> null
      - event_based_hold    = false -> null
      - generation          = 1768938342507989 -> null
      - id                  = "europe-west1-demo-lab-c7a17e4c-bucket-dags/dbt-dag.py" -> null
      - md5hash             = "I4t9GoCkwXqXT8LfIZcBOw==" -> null
      - media_link          = "https://storage.googleapis.com/download/storage/v1/b/europe-west1-demo-lab-c7a17e4c-bucket/o/dags%2Fdbt-dag.py?generation=1768938342507989&alt=media" -> null
      - name                = "dags/dbt-dag.py" -> null
      - output_name         = "dags/dbt-dag.py" -> null
      - self_link           = "https://www.googleapis.com/storage/v1/b/europe-west1-demo-lab-c7a17e4c-bucket/o/dags%2Fdbt-dag.py" -> null
      - source              = "modules/data-pipeline/resources/dbt-dag.py" -> null
      - storage_class       = "STANDARD" -> null
      - temporary_hold      = false -> null
        # (5 unchanged attributes hidden)
    }

  # module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"] will be destroyed
  # (because google_storage_bucket_object.job-code is not in configuration)
  - resource "google_storage_bucket_object" "job-code" {
      - bucket              = "tbd-2025z-319020-code" -> null
      - content_type        = "text/plain; charset=utf-8" -> null
      - crc32c              = "CcYmJA==" -> null
      - detect_md5hash      = "htqzZhDqcyvcd87anSUysQ==" -> null
      - event_based_hold    = false -> null
      - generation          = 1768936901409421 -> null
      - id                  = "tbd-2025z-319020-code-spark-job.py" -> null
      - md5hash             = "htqzZhDqcyvcd87anSUysQ==" -> null
      - media_link          = "https://storage.googleapis.com/download/storage/v1/b/tbd-2025z-319020-code/o/spark-job.py?generation=1768936901409421&alt=media" -> null
      - name                = "spark-job.py" -> null
      - output_name         = "spark-job.py" -> null
      - self_link           = "https://www.googleapis.com/storage/v1/b/tbd-2025z-319020-code/o/spark-job.py" -> null
      - source              = "modules/data-pipeline/resources/spark-job.py" -> null
      - storage_class       = "STANDARD" -> null
      - temporary_hold      = false -> null
        # (5 unchanged attributes hidden)
    }

  # module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster will be created
  + resource "google_dataproc_cluster" "tbd-dataproc-cluster" {
      + effective_labels              = (known after apply)
      + graceful_decommission_timeout = "0s"
      + id                            = (known after apply)
      + name                          = "tbd-cluster"
      + project                       = "tbd-2025z-319020"
      + region                        = "europe-west1"
      + terraform_labels              = (known after apply)

      + cluster_config {
          + bucket         = (known after apply)
          + staging_bucket = "tbd-2025z-319020-dataproc-staging"
          + temp_bucket    = "tbd-2025z-319020-dataproc-temp"

          + auxiliary_node_groups (known after apply)

          + dataproc_metric_config (known after apply)

          + endpoint_config {
              + enable_http_port_access = true
              + http_ports              = (known after apply)
            }

          + gce_cluster_config {
              + internal_ip_only       = true
              + metadata               = {
                  + "PIP_PACKAGES" = "pandas<2 mlflow==2.3.1 google-cloud-storage==2.9.0 jupyterlab==3.6.3 dbt-core==1.8.7 dbt-spark==1.8.0"
                  + "vmDnsSetting" = "GlobalDefault"
                }
              + network                = (known after apply)
              + service_account        = "tbd-2025z-319020-dataproc-sa@tbd-2025z-319020.iam.gserviceaccount.com"
              + service_account_scopes = [
                  + "https://www.googleapis.com/auth/cloud-platform",
                ]
              + subnetwork             = "projects/tbd-2025z-319020/regions/europe-west1/subnetworks/subnet-01"
              + zone                   = (known after apply)

              + node_group_affinity (known after apply)

              + reservation_affinity (known after apply)

              + shielded_instance_config (known after apply)
            }

          + initialization_action {
              + script      = "gs://goog-dataproc-initialization-actions-europe-west1/python/pip-install.sh"
              + timeout_sec = 600
            }

          + master_config {
              + image_uri        = (known after apply)
              + instance_names   = (known after apply)
              + machine_type     = "e2-standard-2"
              + min_cpu_platform = (known after apply)
              + num_instances    = 1

              + disk_config {
                  + boot_disk_size_gb = 100
                  + boot_disk_type    = "pd-standard"
                  + num_local_ssds    = (known after apply)
                }
            }

          + preemptible_worker_config (known after apply)

          + software_config {
              + image_version       = "2.2.69-ubuntu22"
              + optional_components = [
                  + "JUPYTER",
                ]
              + properties          = (known after apply)
            }

          + worker_config {
              + image_uri         = (known after apply)
              + instance_names    = (known after apply)
              + machine_type      = "e2-standard-2"
              + min_cpu_platform  = (known after apply)
              + min_num_instances = (known after apply)
              + num_instances     = 2

              + disk_config {
                  + boot_disk_size_gb = 100
                  + boot_disk_type    = "pd-standard"
                  + num_local_ssds    = (known after apply)
                }
            }
        }

      + virtual_cluster_config (known after apply)
    }

  # module.metastore.google_project_service.api-metastore["metastore.googleapis.com"] will be destroyed
  # (because google_project_service.api-metastore is not in configuration)
  - resource "google_project_service" "api-metastore" {
      - disable_on_destroy = false -> null
      - id                 = "tbd-2025z-319020/metastore.googleapis.com" -> null
      - project            = "tbd-2025z-319020" -> null
      - service            = "metastore.googleapis.com" -> null
    }

  # module.composer.module.composer.google_composer_environment.composer_env will be destroyed
  # (because google_composer_environment.composer_env is not in configuration)
  - resource "google_composer_environment" "composer_env" {
      - effective_labels = {} -> null
      - id               = "projects/tbd-2025z-319020/locations/europe-west1/environments/demo-lab" -> null
      - name             = "demo-lab" -> null
      - project          = "tbd-2025z-319020" -> null
      - region           = "europe-west1" -> null
      - terraform_labels = {} -> null

      - config {
          - airflow_uri                = "https://5187fd041ead457e8bc029d3878135fc-dot-europe-west1.composer.googleusercontent.com" -> null
          - dag_gcs_prefix             = "gs://europe-west1-demo-lab-c7a17e4c-bucket/dags" -> null
          - enable_private_builds_only = false -> null
          - enable_private_environment = false -> null
          - environment_size           = "ENVIRONMENT_SIZE_SMALL" -> null
          - gke_cluster                = "projects/tbd-2025z-319020/locations/europe-west1/clusters/europe-west1-demo-lab-c7a17e4c-gke" -> null
          - node_count                 = 0 -> null
          - resilience_mode            = "STANDARD_RESILIENCE" -> null

          - data_retention_config {
              - task_logs_retention_config {
                  - storage_mode = "CLOUD_LOGGING_ONLY" -> null
                }
            }

          - database_config {
                # (2 unchanged attributes hidden)
            }

          - encryption_config {
                # (1 unchanged attribute hidden)
            }

          - maintenance_window {
              - end_time   = "1970-01-01T04:00:00Z" -> null
              - recurrence = "FREQ=WEEKLY;BYDAY=FR,SA,SU" -> null
              - start_time = "1970-01-01T00:00:00Z" -> null
            }

          - node_config {
              - disk_size_gb                      = 0 -> null
              - enable_ip_masq_agent              = false -> null
              - ip_allocation_policy              = [
                  - {
                      - use_ip_aliases                = false
                        # (4 unchanged attributes hidden)
                    },
                ] -> null
              - max_pods_per_node                 = 0 -> null
              - network                           = "projects/tbd-2025z-319020/global/networks/main-vpc" -> null
              - oauth_scopes                      = [] -> null
              - service_account                   = "tbd-2025z-319020-data@tbd-2025z-319020.iam.gserviceaccount.com" -> null
              - subnetwork                        = "projects/tbd-2025z-319020/regions/europe-west1/subnetworks/composer-subnet-01" -> null
                # (4 unchanged attributes hidden)
            }

          - private_environment_config {
              - cloud_composer_network_ipv4_cidr_block = "172.31.251.0/24" -> null
              - cloud_sql_ipv4_cidr_block              = "10.0.0.0/12" -> null
              - enable_private_endpoint                = false -> null
              - enable_privately_used_public_ips       = false -> null
                # (4 unchanged attributes hidden)
            }

          - software_config {
              - env_variables           = {
                  - "AIRFLOW_VAR_BUCKET_NAME"         = "tbd-2025z-319020-code"
                  - "AIRFLOW_VAR_DBT_GIT_REPO"        = "https://github.com/mwiewior/tbd-tpc-di.git"
                  - "AIRFLOW_VAR_DBT_GIT_REPO_BRANCH" = "main"
                  - "AIRFLOW_VAR_PHS_CLUSTER"         = "tbd-cluster"
                  - "AIRFLOW_VAR_PROJECT_ID"          = "tbd-2025z-319020"
                  - "AIRFLOW_VAR_REGION_NAME"         = "europe-west1"
                  - "AIRFLOW_VAR_WRK_NAMESPACE"       = "composer-user-workloads"
                } -> null
              - image_version           = "composer-2.11.5-airflow-2.9.3" -> null
              - scheduler_count         = 0 -> null
                # (2 unchanged attributes hidden)

              - cloud_data_lineage_integration {
                  - enabled = false -> null
                }
            }

          - web_server_network_access_control {
              - allowed_ip_range {
                  - description = "Allows access from all IPv4 addresses (default value)" -> null
                  - value       = "0.0.0.0/0" -> null
                }
              - allowed_ip_range {
                  - description = "Allows access from all IPv6 addresses (default value)" -> null
                  - value       = "::0/0" -> null
                }
            }

          - workloads_config {
              - scheduler {
                  - count      = 1 -> null
                  - cpu        = 0.5 -> null
                  - memory_gb  = 1.875 -> null
                  - storage_gb = 1 -> null
                }
              - web_server {
                  - cpu        = 0.5 -> null
                  - memory_gb  = 1.875 -> null
                  - storage_gb = 1 -> null
                }
              - worker {
                  - cpu        = 0.5 -> null
                  - max_count  = 3 -> null
                  - memory_gb  = 1.875 -> null
                  - min_count  = 1 -> null
                  - storage_gb = 1 -> null
                }
            }
        }

      - storage_config {
          - bucket = "europe-west1-demo-lab-c7a17e4c-bucket" -> null
        }
    }

  # module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0] will be destroyed
  # (because google_project_iam_member.composer_agent_service_account is not in configuration)
  - resource "google_project_iam_member" "composer_agent_service_account" {
      - etag    = "BwZI1rlIY3U=" -> null
      - id      = "tbd-2025z-319020/roles/composer.ServiceAgentV2Ext/serviceAccount:service-214296123186@cloudcomposer-accounts.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:service-214296123186@cloudcomposer-accounts.iam.gserviceaccount.com" -> null
      - project = "tbd-2025z-319020" -> null
      - role    = "roles/composer.ServiceAgentV2Ext" -> null
    }

Plan: 1 to add, 0 to change, 16 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named
"ai_notebook_instance_owner" but a value was found in file
"env/project.tfvars". If you meant to use this value, add a "variable" block
to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

```

</details>

*Pusher: @DawidBudzynsky, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*